clear all;
%作者：罗族==软组织空间受力拟合===================
%时间：2016-10-17================================
%修改：2016-11-20================================
%=========空间受力软组织形变曲面拟合=================
%%
%=====================初始化=====================
x0=zeros(11,1);
y0=zeros(11,1);
z0=zeros(11,1);
xn=zeros(121,1);
yn=zeros(121,1);
zn=zeros(121,1);
x1=zeros(121,1);
y1=zeros(121,1);
z1=zeros(121,1);
x2=zeros(121,1);
y2=zeros(121,1);
z2=zeros(121,1);
x3=zeros(121,1);
y3=zeros(121,1);
z3=zeros(121,1);
%%
%==============受力点各方向形变求解========================
F=input('请输入力[Fx Fz Fy]:');
tic;
Fx=F(1);Fz=F(2);Fy=F(3);
%--------------Fx-----------------------------------
Dx61=Gx(Fx);
xPx=DxparameterX(Dx61);
xPy=DxparameterY(Dx61);
xPz=DxparameterZ(Dx61);
%--------------Fy-----------------------------------
Dy61=Gx(Fy);
yPx=DxparameterX(Dy61);
yPy=DxparameterY(Dy61);
yPz=DxparameterZ(Dy61);
%--------------Fz----------------------------------
Dz61=Gz(Fz);
zPx=DzparameterX(Dz61);
zPy=DzparameterY(Dz61);
zPz=DzparameterZ(Dz61);
%%
%===============基准坐标=============
%-公式推演时设施力方向为Z，实际施力方向为Y---
for i=1:11
    x0(i,1)=(i-1)*4.8;
end
for i=1:11
    z0(i,1)=(i-1)*4.8;
end
for i=1:11
    y0(i,1)=6;
end
%%
%==================各方向施力形变求解=================================
%==================Fx方向分力受力形变计算==============================
%--------------求解DX曲面---(施力面)-----------------
for i=1:11
    for j=1:11
        x1(11*(i-1)+j,1)=xPx(1,1)+xPx(2,1)*x0(j,1)+xPx(3,1)*x0(j,1)^2+xPx(4,1)*x0(j,1)^3+xPx(5,1)*x0(j,1)^4+xPx(6,1)*z0(i,1)+xPx(7,1)*z0(i,1)^2+xPx(8,1)*z0(i,1)^3+xPx(9,1)*z0(i,1)^4;
    end
end
%--------------求解DZ曲面--------------------
for i=1:11
    for j=1:11
        z1(11*(i-1)+j,1)=0;
    end
end
%--------------求解DY曲面-------------
for i=1:11
    for j=1:11
        y1(11*(i-1)+j,1)=xPz(1,1)+xPz(2,1)*x0(j,1)+xPz(3,1)*x0(j,1)^2+xPz(4,1)*x0(j,1)^3+xPz(5,1)*z0(i,1);
    end
end
%==================Fy方向分力受力形变计算（%!!修改ij实现XY方向转化）==============================
%--------------求解DX曲面--------------------
for i=1:11
    for j=1:11
        x2(11*(i-1)+j,1)=0;
    end
end
%--------------求解DZ曲面------(施力面)--------------
for i=1:11
    for j=1:11
        z2(11*(j-1)+i,1)=yPx(1,1)+yPx(2,1)*x0(j,1)+yPx(3,1)*x0(j,1)^2+yPx(4,1)*x0(j,1)^3+yPx(5,1)*x0(j,1)^4+yPx(6,1)*z0(i,1)+yPx(7,1)*z0(i,1)^2+yPx(8,1)*z0(i,1)^3+yPx(9,1)*z0(i,1)^4;
    end
end
%--------------求解DY曲面-------------
for i=1:11
    for j=1:11
        y2(11*(j-1)+i,1)=yPz(1,1)+yPz(2,1)*x0(j,1)+yPz(3,1)*x0(j,1)^2+yPz(4,1)*x0(j,1)^3+yPz(5,1)*z0(i,1);
    end
end
%==================Fz方向分力受力形变计算==============================
%--------------求解DX曲面--------------------
for i=1:11
    for j=1:11
        x3(11*(i-1)+j,1)=zPx(1,1)+zPx(2,1)*x0(j,1)+zPx(3,1)*x0(j,1)^2+zPx(4,1)*x0(j,1)^3+zPx(5,1)*x0(j,1)^4+zPx(6,1)*x0(j,1)^5+zPx(7,1)*z0(i,1);
    end
end
%--------------求解DZ曲面--------------------
for i=1:11
    for j=1:11
        z3(11*(i-1)+j,1)=zPy(1,1)+zPy(2,1)*x0(j,1)+zPy(3,1)*z0(i,1)+zPy(4,1)*z0(i,1)^2+zPy(5,1)*z0(i,1)^3+zPy(6,1)*z0(i,1)^4+zPy(7,1)*z0(i,1)^5;
    end
end
%--------------求解DY曲面---(施力面)----------
for i=1:11
    for j=1:11
        y3(11*(i-1)+j,1)=zPz(1,1)+zPz(2,1)*x0(j,1)+zPz(3,1)*x0(j,1)^2+zPz(4,1)*x0(j,1)^3+zPz(5,1)*x0(j,1)^4+zPz(6,1)*z0(i,1)+zPz(7,1)*z0(i,1)^2+zPz(8,1)*z0(i,1)^3+zPz(9,1)*z0(i,1)^4;
    end
end
%================================================

%%
%=============形变量与基准坐标相加==============
for i=1:11%x
    for j=1:11
        xn(11*(i-1)+j,1)=x1(11*(i-1)+j,1)+x2(11*(i-1)+j,1)+x3(11*(i-1)+j,1)+x0(j,1);
    end
end
for i=1:11%y
    for j=1:11
        zn(11*(i-1)+j,1)=z1(11*(i-1)+j,1)+z2(11*(i-1)+j,1)+z3(11*(i-1)+j,1)+z0(i,1);
    end
end
for i=1:11%z
    for j=1:11
        yn(11*(i-1)+j,1)=y1(11*(i-1)+j,1)+y2(11*(i-1)+j,1)+y3(11*(i-1)+j,1)+y0(j,1);
    end
end

%%
%========顶点拟合补偿==========
yn(61,1)=6+Dz61;%垂直水平面施力即Z方向
xn(61,1)=24+Dx61;%水平方向X
zn(61,1)=24+Dy61;%水平方向Y
%======计算反馈力===========
Ffb=zeros(1,3);
[Ffb(1,1),Ffb(1,2),Ffb(1,3)]=NG(Dx61,Dz61,Dy61);
%%
%===================绘制图形====================
plot3(xn,zn,yn,'o');grid
axis([-2,50,-2,50,-3,8]);
hold on
ti=-0.1:0.8:48.1;
[xi,yi]=meshgrid(ti,ti);        %加密数据
zi=griddata(xn,zn,yn,xi,yi);    %线性插值
mesh(xi,yi,zi);
hold on
str=['Fi[x,z,y]=',num2str(F)];
title(str);
xlabel('Displacement[X](mm)');ylabel('Displacement[Y](mm)');zlabel('Displacement[Z](mm)')
toc;
fprintf('Ffeedback[Fx,Fz,Fy]=%f，%f,%f\n',Ffb(1,1),Ffb(1,2),Ffb(1,3));